//=============================================================================
//
// choice.cpp
// Author : tanimoto kosuke
//
//=============================================================================
#include "choice.h"
#include "Application.h"

//=====================================
// デフォルトコンストラクタ
//=====================================
CChoice::CChoice()
{

}

//=====================================
// デストラクタ
//=====================================
CChoice::~CChoice()
{

}

//=====================================
// 初期化処理
//=====================================
HRESULT CChoice::Init(void)
{
	//CFont *m_pFont[20];

	//// すたーと
	//int nTex1[4] = { 12, 15, 48, 19 };
	//for (int i = 0; i < 4; i++)
	//{
	//	m_pFont[i] = CFont::Create(D3DXVECTOR2(0.0f, 0.0f), D3DXVECTOR2(30.0f, 30.0f), nTex1[i], 5, i, 4);
	//}

	//// おわり
	//int nTex2[3] = { 4, 45, 41 };
	//for (int i = 0; i < 3; i++)
	//{
	//	m_pFont[i] = CFont::Create(D3DXVECTOR2(0.0f, 90.0f), D3DXVECTOR2(30.0f, 30.0f), nTex2[i], 5, i, 3);
	//}

	return S_OK;
}

//=====================================
// 終了処理
//=====================================
void CChoice::Uninit(void)
{

}

//=====================================
// 更新処理
//=====================================
void CChoice::Update(void)
{

}

//=====================================
// 生成処理
//=====================================
CChoice* CChoice::Create(void)
{
	CChoice* pChoice = new CChoice;

	if (FAILED(pChoice->Init()))
	{
		return nullptr;
	}

	return pChoice;
}