//============================================================================
//
//
// ライトの処理
// Author:谷本康輔
//
//============================================================================
#ifndef _LIGHT_H_		//このマクロ定義がされてなかったら
#define _LIGHT_H_		//2連インクルード防止のマクロ定義

#include "main.h"		//作成したmain.hをインクルードする

//****************************************************************************
//マクロ定義
//****************************************************************************
#define MAX_LIGHT			(4)	//光の最大設置数

class CLight
{
public:
	void Init();
	void Uninit();
	void Update();

	D3DLIGHT9 GetLight() { return m_light[0]; }
private:
	D3DLIGHT9 m_light[MAX_LIGHT];	//ライト情報
};

#endif #pragma once
