//=============================================================================
//
// menu.h
// Author : tanimoto kosuke
//
//=============================================================================
#ifndef _MENU_H_
#define _MENU_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "choice.h"

//---------------------------
//クラス宣言
//---------------------------
class CMenu
{
public:
	CMenu();
	~CMenu();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

	static CMenu* Create(void);			//生成処理
private:
	CChoice* m_pChoice;
};

#endif // !_MENU_H_
